In [1]:
import pandas as pd

# Reading and Writing data:

# Read data from csv file

In [8]:
pd.read_csv('readingcsv.csv')

   <built-in function id>    name  phno
0                     101  prasad   961

# write dataframe to csv file

In [6]:
data={'name':['divya'],
     'age':[21],
     'occ':['news reporter']}
df=pd.DataFrame(data)
df.to_csv('writingcsv.csv',index=False)

# Read data from excel file

In [10]:
pd.read_excel('readingexcel.xlsx')

   <built-in function id>    name  phno
0                     101  prasad   961

# write dataframe to excel file

In [13]:
data=ocation = {
    "city": ["New Delhi"],
    "latitude": [28.6139],     
    "longitude": [77.2090]     
}
df=pd.DataFrame(data)
df.to_excel('writingexcel.xlsx',index=False)

# Exploring data

# read 1st n row

In [15]:
students = [
    {"id": 101, "first_name": "Aarav",   "last_name": "Singh",    "age": 16, "grade": 10, "GPA": 8.5, "extracurricular": True},
    {"id": 102, "first_name": "Meera",   "last_name": "Patel",    "age": 17, "grade": 11, "GPA": 9.1, "extracurricular": False},
    {"id": 103, "first_name": "Rohan",   "last_name": "Verma",    "age": 16, "grade": 10, "GPA": 7.8, "extracurricular": True},
    {"id": 104, "first_name": "Sana",    "last_name": "Reddy",    "age": 18, "grade": 12, "GPA": 8.9, "extracurricular": True},
    {"id": 105, "first_name": "Kabir",   "last_name": "Sharma",   "age": 17, "grade": 11, "GPA": 8.2, "extracurricular": False},
    {"id": 106, "first_name": "Priya",   "last_name": "Nair",     "age": 16, "grade": 10, "GPA": 9.3, "extracurricular": True},
    {"id": 107, "first_name": "Aditya",  "last_name": "Gupta",    "age": 18, "grade": 12, "GPA": 7.5, "extracurricular": False}
]
df=pd.DataFrame(students)
df.to_csv('stu.csv',index=False)

In [17]:
df.head(1)

    id first_name last_name  age  grade  GPA  extracurricular
0  101      Aarav     Singh   16     10  8.5             True

# display the last n rows

In [18]:
df.tail(1)

    id first_name last_name  age  grade  GPA  extracurricular
6  107     Aditya     Gupta   18     12  7.5            False

# summary statistics

In [19]:
df .describe()

               id        age      grade       GPA
count    7.000000   7.000000   7.000000  7.000000
mean   104.000000  16.857143  10.857143  8.471429
std      2.160247   0.899735   0.899735  0.675066
min    101.000000  16.000000  10.000000  7.500000
25%    102.500000  16.000000  10.000000  8.000000
50%    104.000000  17.000000  11.000000  8.500000
75%    105.500000  17.500000  11.500000  9.000000
max    107.000000  18.000000  12.000000  9.300000

# info about dataframes

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               7 non-null      int64
 1   first_name       7 non-null      object
 2   last_name        7 non-null      object
 3   age              7 non-null      int64
 4   grade            7 non-null      int64
 5   GPA              7 non-null      float64
 6   extracurricular  7 non-null      bool
dtypes: bool(1), float64(1), int64(3), object(2)
memory usage: 475.0+ bytes

# shape

In [94]:
df.shape

(7, 7)

# dtype

In [95]:
df.dtypes

id                   int64
first_name          object
last_name           object
age                  int64
grade                int64
GPA                float64
extracurricular       bool
dtype: object

# unique values in a column

In [21]:
df['GPA'].unique()

array([8.5, 9.1, 7.8, 8.9, 8.2, 9.3, 7.5])

# no of unique values in a column

In [22]:
df['GPA'].nunique()

7

# count occurrance of each unique values

In [23]:
df['GPA'].value_counts()

GPA
8.5    1
9.1    1
7.8    1
8.9    1
8.2    1
9.3    1
7.5    1
Name: count, dtype: int64

# Data selection and filtering

# selecting the single column

In [24]:
df['GPA']

0    8.5
1    9.1
2    7.8
3    8.9
4    8.2
5    9.3
6    7.5
Name: GPA, dtype: float64

# selecing multiple columns

In [26]:
df[['GPA','grade']]

   GPA  grade
0  8.5     10
1  9.1     11
2  7.8     10
3  8.9     12
4  8.2     11
5  9.3     10
6  7.5     12

# filtering row based on condition

In [34]:
df[df['GPA']<8]

    id first_name last_name  age  grade  GPA  extracurricular
2  103      Rohan     Verma   16     10  7.8             True
6  107     Aditya     Gupta   18     12  7.5            False

# filtering multiple conditons

In [38]:
df[(df['GPA']>7)& (df['GPA']<8)]

    id first_name last_name  age  grade  GPA  extracurricular
2  103      Rohan     Verma   16     10  7.8             True
6  107     Aditya     Gupta   18     12  7.5            False

# uisng isin() for filtering

In [41]:
df[df['GPA'].isin([7.8,7.5])]

    id first_name last_name  age  grade  GPA  extracurricular
2  103      Rohan     Verma   16     10  7.8             True
6  107     Aditya     Gupta   18     12  7.5            False

# Handling missing data

# check for missing values

In [42]:
df.isnull()

      id  first_name  last_name    age  grade    GPA  extracurricular
0  False       False      False  False  False  False            False
1  False       False      False  False  False  False            False
2  False       False      False  False  False  False            False
3  False       False      False  False  False  False            False
4  False       False      False  False  False  False            False
5  False       False      False  False  False  False            False
6  False       False      False  False  False  False            False

# drop rows with any  missing values

In [43]:
df.dropna()

    id first_name last_name  age  grade  GPA  extracurricular
0  101      Aarav     Singh   16     10  8.5             True
1  102      Meera     Patel   17     11  9.1            False
2  103      Rohan     Verma   16     10  7.8             True
3  104       Sana     Reddy   18     12  8.9             True
4  105      Kabir    Sharma   17     11  8.2            False
5  106      Priya      Nair   16     10  9.3             True
6  107     Aditya     Gupta   18     12  7.5            False

# fill missing values with a specific value

In [44]:
df.fillna(10)

    id first_name last_name  age  grade  GPA  extracurricular
0  101      Aarav     Singh   16     10  8.5             True
1  102      Meera     Patel   17     11  9.1            False
2  103      Rohan     Verma   16     10  7.8             True
3  104       Sana     Reddy   18     12  8.9             True
4  105      Kabir    Sharma   17     11  8.2            False
5  106      Priya      Nair   16     10  9.3             True
6  107     Aditya     Gupta   18     12  7.5            False

# check duplictes row

In [96]:
df.duplicated()

date
1970-01-01 00:00:00.000000016    False
1970-01-01 00:00:00.000000017    False
1970-01-01 00:00:00.000000016    False
1970-01-01 00:00:00.000000018    False
1970-01-01 00:00:00.000000017    False
1970-01-01 00:00:00.000000016    False
1970-01-01 00:00:00.000000018    False
dtype: bool

# drop duplicates

In [97]:
df.drop_duplicates()

,id,first_name,last_name,age,grade,GPA,extracurricular
date,,,,,,,
1970-01-01 00:00:00.000000016,101,Aarav,Singh,16,10,8.5,True
1970-01-01 00:00:00.000000017,102,Meera,Patel,17,11,9.1,False
1970-01-01 00:00:00.000000016,103,Rohan,Verma,16,10,7.8,True
1970-01-01 00:00:00.000000018,104,Sana,Reddy,18,12,8.9,True
1970-01-01 00:00:00.000000017,105,Kabir,Sharma,17,11,8.2,False
1970-01-01 00:00:00.000000016,106,Priya,Nair,16,10,9.3,True
1970-01-01 00:00:00.000000018,107,Aditya,Gupta,18,12,7.5,False

# interpolate missing values

In [45]:
df.interpolate()

C:\Users\chaka\AppData\Local\Temp\ipykernel_20916\4002874584.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

    id first_name last_name  age  grade  GPA  extracurricular
0  101      Aarav     Singh   16     10  8.5             True
1  102      Meera     Patel   17     11  9.1            False
2  103      Rohan     Verma   16     10  7.8             True
3  104       Sana     Reddy   18     12  8.9             True
4  105      Kabir    Sharma   17     11  8.2            False
5  106      Priya      Nair   16     10  9.3             True
6  107     Aditya     Gupta   18     12  7.5            False

# changing datatypes

In [98]:
df['GPA'].astype(int)

date
1970-01-01 00:00:00.000000016    8
1970-01-01 00:00:00.000000017    9
1970-01-01 00:00:00.000000016    7
1970-01-01 00:00:00.000000018    8
1970-01-01 00:00:00.000000017    8
1970-01-01 00:00:00.000000016    9
1970-01-01 00:00:00.000000018    7
Name: GPA, dtype: int64

# Grouping and aggregations

# group by a column and calculate mean

In [52]:
df.groupby('age')[['GPA']].mean(numeric_only=True)

          GPA
age
16   8.533333
17   8.650000
18   8.200000

# group by multiple columns and calculate sum

In [53]:
df.groupby('age')[['GPA','grade']].sum(numeric_only=True)

      GPA  grade
age
16   25.6     30
17   17.3     22
18   16.4     24

# Aggregationwith multiple fun

In [56]:
df.groupby('age')[['GPA','grade']].agg(['mean','sum'])

          GPA       grade
         mean   sum  mean sum
age
16   8.533333  25.6  10.0  30
17   8.650000  17.3  11.0  22
18   8.200000  16.4  12.0  24

# pivot table
#A pivot table is a tool for reorganizing, summarizing, and analyzing large datasets by grouping data into meaningful categories and applying aggregate functions like sum, mean, count, min/max, etc. It doesn't modify the original datajust offers different perspectives by "pivoting" rows into columns and vice versa

In [58]:
pd.pivot_table(df,values='id',index=['GPA','grade'],columns='age')

age           16     17     18
GPA grade
7.5 12       NaN    NaN  107.0
7.8 10     103.0    NaN    NaN
8.2 11       NaN  105.0    NaN
8.5 10     101.0    NaN    NaN
8.9 12       NaN    NaN  104.0
9.1 11       NaN  102.0    NaN
9.3 10     106.0    NaN    NaN

# Data Manipulation

# adding a new column

In [61]:
df['ph']=[123,345,567,789,908,101,343]

# deleting a new column

In [100]:
del df['age']

KeyError: 'age'

# renaming column

In [62]:
df.rename(columns={'ph':'ph_no'},inplace=True)

# sorting by column

In [65]:
df.sort_values(by='age',ascending=False)

    id first_name last_name  age  grade  GPA  extracurricular  ph_no
3  104       Sana     Reddy   18     12  8.9             True    789
6  107     Aditya     Gupta   18     12  7.5            False    343
1  102      Meera     Patel   17     11  9.1            False    345
4  105      Kabir    Sharma   17     11  8.2            False    908
0  101      Aarav     Singh   16     10  8.5             True    123
2  103      Rohan     Verma   16     10  7.8             True    567
5  106      Priya      Nair   16     10  9.3             True    101

In [ ]:
# Drop a column and use axis=1,which means column=1 in pandas

In [67]:
df.drop('ph_no',axis=1,inplace=True)

# concatenating dataframes

In [72]:
data={'name':['latha'],'age':21}
df1=pd.DataFrame(data)

In [73]:
newdf=pd.concat([df,df1])

In [77]:
newdf.head(8)

      id first_name last_name  age  grade  GPA extracurricular   name
0  101.0      Aarav     Singh   16   10.0  8.5            True    NaN
1  102.0      Meera     Patel   17   11.0  9.1           False    NaN
2  103.0      Rohan     Verma   16   10.0  7.8            True    NaN
3  104.0       Sana     Reddy   18   12.0  8.9            True    NaN
4  105.0      Kabir    Sharma   17   11.0  8.2           False    NaN
5  106.0      Priya      Nair   16   10.0  9.3            True    NaN
6  107.0     Aditya     Gupta   18   12.0  7.5           False    NaN
0    NaN        NaN       NaN   21    NaN  NaN             NaN  latha

# Time series operations

# convert a column to datetime

In [83]:
df['date']=pd.to_datetime(df['age'])

# set datetime column as index

In [85]:
df.set_index('date',inplace=True)

In [ ]:
# resampling time series data ,here D -means,datawise ,we have M(month),W(weekly)

In [93]:
df.resample('D').mean(numeric_only=True)

               id        age      grade       GPA  extracurricular
date
1970-01-01  104.0  16.857143  10.857143  8.471429         0.571429